HexSense-MIT/firmware/STM32F722/DW3000/DW3000_op/DW3000_op/Core/Inc/dw3000_regs.h
/******************************************************************************
* @brief Bit definitions for register ADR_FILT_CFG
**/
#define ADR_FILT_CFG_ID                      0x14                 
#define ADR_FILT_CFG_LEN                     (4U)                
#define ADR_FILT_CFG_MASK                    0xFFFFFFFFUL        
#define ADR_FILT_CFG_LSADRAPE_BIT_OFFSET     (15U)               
#define ADR_FILT_CFG_LSADRAPE_BIT_LEN        (1U)                
#define ADR_FILT_CFG_LSADRAPE_BIT_MASK       0x8000U              
#define ADR_FILT_CFG_SSADRAPE_BIT_OFFSET     (14U)               
#define ADR_FILT_CFG_SSADRAPE_BIT_LEN        (1U)                
#define ADR_FILT_CFG_SSADRAPE_BIT_MASK       0x4000U              
#define ADR_FILT_CFG_LE3_PEND_BIT_OFFSET     (13U)               
#define ADR_FILT_CFG_LE3_PEND_BIT_LEN        (1U)                
#define ADR_FILT_CFG_LE3_PEND_BIT_MASK       0x2000U              
#define ADR_FILT_CFG_LE2_PEND_BIT_OFFSET     (12U)               
#define ADR_FILT_CFG_LE2_PEND_BIT_LEN        (1U)                
#define ADR_FILT_CFG_LE2_PEND_BIT_MASK       0x1000U              
#define ADR_FILT_CFG_LE1_PEND_BIT_OFFSET     (11U)               
#define ADR_FILT_CFG_LE1_PEND_BIT_LEN        (1U)                
#define ADR_FILT_CFG_LE1_PEND_BIT_MASK       0x800U               
#define ADR_FILT_CFG_LE0_PEND_BIT_OFFSET     (10U)               
#define ADR_FILT_CFG_LE0_PEND_BIT_LEN        (1U)                
#define ADR_FILT_CFG_LE0_PEND_BIT_MASK       0x400U               
#define ADR_FILT_CFG_FFIB_BIT_OFFSET         (9U)                
#define ADR_FILT_CFG_FFIB_BIT_LEN            (1U)                
#define ADR_FILT_CFG_FFIB_BIT_MASK           0x200U               
#define ADR_FILT_CFG_FFBC_BIT_OFFSET         (8U)                
#define ADR_FILT_CFG_FFBC_BIT_LEN            (1U)                
#define ADR_FILT_CFG_FFBC_BIT_MASK           0x100U               
#define ADR_FILT_CFG_FFAE_BIT_OFFSET         (7U)                
#define ADR_FILT_CFG_FFAE_BIT_LEN            (1U)                
#define ADR_FILT_CFG_FFAE_BIT_MASK           0x80U                
#define ADR_FILT_CFG_FFAF_BIT_OFFSET         (6U)                
#define ADR_FILT_CFG_FFAF_BIT_LEN            (1U)                
#define ADR_FILT_CFG_FFAF_BIT_MASK           0x40U                
#define ADR_FILT_CFG_FFAMULTI_BIT_OFFSET     (5U)                
#define ADR_FILT_CFG_FFAMULTI_BIT_LEN        (1U)                
#define ADR_FILT_CFG_FFAMULTI_BIT_MASK       0x20U                
#define ADR_FILT_CFG_FFAR_BIT_OFFSET         (4U)                
#define ADR_FILT_CFG_FFAR_BIT_LEN            (1U)                
#define ADR_FILT_CFG_FFAR_BIT_MASK           0x10U                
#define ADR_FILT_CFG_FFAM_BIT_OFFSET         (3U)                
#define ADR_FILT_CFG_FFAM_BIT_LEN            (1U)                
#define ADR_FILT_CFG_FFAM_BIT_MASK           0x8U                 
#define ADR_FILT_CFG_FFAA_BIT_OFFSET         (2U)                
#define ADR_FILT_CFG_FFAA_BIT_LEN            (1U)                
#define ADR_FILT_CFG_FFAA_BIT_MASK           0x4U                 
#define ADR_FILT_CFG_FFAD_BIT_OFFSET         (1U)                
#define ADR_FILT_CFG_FFAD_BIT_LEN            (1U)                
#define ADR_FILT_CFG_FFAD_BIT_MASK           0x2U                 
#define ADR_FILT_CFG_FFAB_BIT_OFFSET         (0U)                
#define ADR_FILT_CFG_FFAB_BIT_LEN            (1U)                
#define ADR_FILT_CFG_FFAB_BIT_MASK           0x1U                 

/******************************************************************************
* @brief Bit definitions for register SPICRC_CFG
**/
#define SPICRC_CFG_ID                        0x18                 
#define SPICRC_CFG_LEN                       (4U)                
#define SPICRC_CFG_MASK                      0xFFFFFFFFUL        
#define SPICRC_CFG_SPI_RD_CRC_BIT_OFFSET     (0U)                
#define SPICRC_CFG_SPI_RD_CRC_BIT_LEN        (8U)                
#define SPICRC_CFG_SPI_RD_CRC_BIT_MASK       0xffU                

/******************************************************************************
* @brief Bit definitions for register SYS_TIME
**/
#define SYS_TIME_ID                          0x1c                 
#define SYS_TIME_LEN                         (4U)                
#define SYS_TIME_MASK                        0xFFFFFFFFUL        
#define SYS_TIME_SYS_TIME_BIT_OFFSET         (1U)                
#define SYS_TIME_SYS_TIME_BIT_LEN            (31U)               
#define SYS_TIME_SYS_TIME_BIT_MASK           0xfffffffeUL         

/******************************************************************************
* @brief Bit definitions for register TX_FCTRL
**/
#define TX_FCTRL_ID                          0x24                 
#define TX_FCTRL_LEN                         (4U)                
#define TX_FCTRL_MASK                        0xFFFFFFFFUL        
#define TX_FCTRL_TXB_OFFSET_BIT_OFFSET       (16U)               
#define TX_FCTRL_TXB_OFFSET_BIT_LEN          (10U)               
#define TX_FCTRL_TXB_OFFSET_BIT_MASK         0x3ff0000UL          
#define TX_FCTRL_TXPSR_BIT_OFFSET         (12U)               
#define TX_FCTRL_TXPSR_BIT_LEN            (4U)                
#define TX_FCTRL_TXPSR_BIT_MASK           0xf000U              
#define TX_FCTRL_TR_BIT_OFFSET               (11U)               
#define TX_FCTRL_TR_BIT_LEN                  (1U)                
#define TX_FCTRL_TR_BIT_MASK                 0x800U               
#define TX_FCTRL_TXBR_BIT_OFFSET             (10U)               
#define TX_FCTRL_TXBR_BIT_LEN                (1U)                
#define TX_FCTRL_TXBR_BIT_MASK               0x400U               
#define TX_FCTRL_TXFLEN_BIT_OFFSET           (0U)                
#define TX_FCTRL_TXFLEN_BIT_LEN              (10U)               
#define TX_FCTRL_TXFLEN_BIT_MASK             0x3ffU               

/******************************************************************************
* @brief Bit definitions for register TX_FCTRL_HI
**/
#define TX_FCTRL_HI_ID                       0x28                 
#define TX_FCTRL_HI_LEN                      (4U)                
#define TX_FCTRL_HI_MASK                     0xFFFFFFFFUL        
#define TX_FCTRL_HI_FINE_PLEN_BIT_OFFSET     (8U)                
#define TX_FCTRL_HI_FINE_PLEN_BIT_LEN        (8U)                
#define TX_FCTRL_HI_FINE_PLEN_BIT_MASK       0xff00U              

