HexSense-MIT/firmware/STM32F722/DW3000/DW3000_op/DW3000_op/Core/Inc/dw3000_regs.h
/******************************************************************************
* @brief Bit definitions for register STS_TOA_LO
**/
#define STS_TOA_LO_ID                        0xc0008              
#define STS_TOA_LO_LEN                       (4U)                
#define STS_TOA_LO_MASK                      0xFFFFFFFFUL        
#define STS_TOA_LO_STS_TOA_BIT_OFFSET         (0U)                
#define STS_TOA_LO_STS_TOA_BIT_LEN            (32U)               
#define STS_TOA_LO_STS_TOA_BIT_MASK           0xffffffffUL         

/******************************************************************************
* @brief Bit definitions for register STS_TOA_HI
**/
#define STS_TOA_HI_ID                        0xc000c              
#define STS_TOA_HI_LEN                       (4U)                
#define STS_TOA_HI_MASK                      0xFFFFFFFFUL        
#define STS_TOA_HI_STS_TOAST_BIT_OFFSET         (23U)               
#define STS_TOA_HI_STS_TOAST_BIT_LEN            (9U)                
#define STS_TOA_HI_STS_TOAST_BIT_MASK           0xff800000UL         
#define STS_TOA_HI_STS_POA_BIT_OFFSET            (8U)                
#define STS_TOA_HI_STS_POA_BIT_LEN               (14U)               
#define STS_TOA_HI_STS_POA_BIT_MASK              0x3fff00UL           
#define STS_TOA_HI_STS_TOA_BIT_OFFSET          (0U)                
#define STS_TOA_HI_STS_TOA_BIT_LEN             (8U)                
#define STS_TOA_HI_STS_TOA_BIT_MASK            0xffU                

/******************************************************************************
* @brief Bit definitions for register STS1_TOA_LO
**/
#define STS1_TOA_LO_ID                        0xc0010              
#define STS1_TOA_LO_LEN                       (4U)                
#define STS1_TOA_LO_MASK                      0xFFFFFFFFUL        
#define STS1_TOA_LO_STS1_TOA_BIT_OFFSET         (0U)                
#define STS1_TOA_LO_STS1_TOA_BIT_LEN            (32U)               
#define STS1_TOA_LO_STS1_TOA_BIT_MASK           0xffffffffUL         

/******************************************************************************
* @brief Bit definitions for register STS1_TOA_HI
**/
#define STS1_TOA_HI_ID                        0xc0014              
#define STS1_TOA_HI_LEN                       (4U)                
#define STS1_TOA_HI_MASK                      0xFFFFFFFFUL        
#define STS1_TOA_HI_STS1_TOAST_BIT_OFFSET         (23U)               
#define STS1_TOA_HI_STS1_TOAST_BIT_LEN            (9U)                
#define STS1_TOA_HI_STS1_TOAST_BIT_MASK           0xff800000UL         
#define STS1_TOA_HI_STS1_POA_BIT_OFFSET            (8U)                
#define STS1_TOA_HI_STS1_POA_BIT_LEN               (14U)               
#define STS1_TOA_HI_STS1_POA_BIT_MASK              0x3fff00UL           
#define STS1_TOA_HI_STS1_TOA_BIT_OFFSET          (0U)                
#define STS1_TOA_HI_STS1_TOA_BIT_LEN             (8U)                
#define STS1_TOA_HI_STS1_TOA_BIT_MASK            0xffU                

/******************************************************************************
* @brief Bit definitions for register CIA_TDOA_0
**/
#define CIA_TDOA_0_ID                        0xc0018              
#define CIA_TDOA_0_LEN                       (4U)                
#define CIA_TDOA_0_MASK                      0xFFFFFFFFUL        
#define CIA_TDOA_0_TDOA_BIT_OFFSET        (0U)                
#define CIA_TDOA_0_TDOA_BIT_LEN           (32U)               
#define CIA_TDOA_0_TDOA_BIT_MASK          0xffffffffUL         

/******************************************************************************
* @brief Bit definitions for register CIA_TDOA_1_PDOA
**/
#define CIA_TDOA_1_PDOA_ID                   0xc001c              
#define CIA_TDOA_1_PDOA_LEN                  (4U)                
#define CIA_TDOA_1_PDOA_MASK                 0xFFFFFFFFUL        
#define CIA_TDOA_1_PDOA_FP_TH_MD_BIT_OFFSET (30U)               
#define CIA_TDOA_1_PDOA_FP_TH_MD_BIT_LEN    (1U)                
#define CIA_TDOA_1_PDOA_FP_TH_MD_BIT_MASK   0x40000000UL         
#define CIA_TDOA_1_PDOA_PDOA_BIT_OFFSET   (16U)               
#define CIA_TDOA_1_PDOA_PDOA_BIT_LEN      (14U)               
#define CIA_TDOA_1_PDOA_PDOA_BIT_MASK     0x3fff0000UL         
#define CIA_TDOA_1_PDOA_TDOA_BIT_OFFSET   (0U)                
#define CIA_TDOA_1_PDOA_TDOA_BIT_LEN      (9U)                
#define CIA_TDOA_1_PDOA_TDOA_BIT_MASK     0x1ffU               

/******************************************************************************
* @brief Bit definitions for register CIA_DIAG_0
**/
#define CIA_DIAG_0_ID                        0xc0020              
#define CIA_DIAG_0_LEN                       (4U)                
#define CIA_DIAG_0_MASK                      0xFFFFFFFFUL        
#define CIA_DIAG_0_COE_PPM_BIT_OFFSET     (0U)                
#define CIA_DIAG_0_COE_PPM_BIT_LEN        (13U)               
#define CIA_DIAG_0_COE_PPM_BIT_MASK       0x1fffU              

/******************************************************************************
* @brief Bit definitions for register CIA_DIAG_1
**/
#define CIA_DIAG_1_ID                        0xc0024              
#define CIA_DIAG_1_LEN                       (4U)                
#define CIA_DIAG_1_MASK                      0xFFFFFFFFUL        

/******************************************************************************
* @brief Bit definitions for register IP_DIAG_0
**/
#define IP_DIAG_0_ID                         0xc0028              
#define IP_DIAG_0_LEN                        (4U)                
#define IP_DIAG_0_MASK                       0xFFFFFFFFUL        

/******************************************************************************
* @brief Bit definitions for register IP_DIAG_1
**/
#define IP_DIAG_1_ID                         0xc002c              
#define IP_DIAG_1_LEN                        (4U)                
#define IP_DIAG_1_MASK                       0xFFFFFFFFUL        

/******************************************************************************
* @brief Bit definitions for register IP_DIAG_2
**/
#define IP_DIAG_2_ID                         0xc0030              
#define IP_DIAG_2_LEN                        (4U)                
#define IP_DIAG_2_MASK                       0xFFFFFFFFUL        

