HexSense-MIT/firmware/STM32F722/DW3000/DW3000_op/DW3000_op/Core/Inc/dw3000_regs.h
/******************************************************************************
* @brief Bit definitions for register EVC_COUNT3
**/
#define EVC_COUNT3_ID                      0xf0010              
#define EVC_COUNT3_LEN                     (4U)                
#define EVC_COUNT3_MASK                    0xFFFFFFFFUL        
#define EVC_COUNT3_EVC_PTO_BIT_OFFSET  (16U)               
#define EVC_COUNT3_EVC_PTO_BIT_LEN     (12U)               
#define EVC_COUNT3_EVC_PTO_BIT_MASK    0xfff0000UL          
#define EVC_COUNT3_EVC_STO_BIT_OFFSET  (0U)                
#define EVC_COUNT3_EVC_STO_BIT_LEN     (12U)               
#define EVC_COUNT3_EVC_STO_BIT_MASK    0xfffU               

/******************************************************************************
* @brief Bit definitions for register EVC_COUNT4
**/
#define EVC_COUNT4_ID                      0xf0014              
#define EVC_COUNT4_LEN                     (4U)                
#define EVC_COUNT4_MASK                    0xFFFFFFFFUL        
#define EVC_COUNT4_EVC_TXFS_BIT_OFFSET  (16U)               
#define EVC_COUNT4_EVC_TXFS_BIT_LEN     (12U)               
#define EVC_COUNT4_EVC_TXFS_BIT_MASK    0xfff0000UL          
#define EVC_COUNT4_EVC_FWTO_BIT_OFFSET   (0U)                
#define EVC_COUNT4_EVC_FWTO_BIT_LEN      (8U)                
#define EVC_COUNT4_EVC_FWTO_BIT_MASK     0xffU                

/******************************************************************************
* @brief Bit definitions for register EVC_COUNT5
**/
#define EVC_COUNT5_ID                      0xf0018              
#define EVC_COUNT5_LEN                     (4U)                
#define EVC_COUNT5_MASK                    0xFFFFFFFFUL        
#define EVC_COUNT5_EVC_SWCE_BIT_OFFSET (16U)               
#define EVC_COUNT5_EVC_SWCE_BIT_LEN    (8U)                
#define EVC_COUNT5_EVC_SWCE_BIT_MASK   0xff0000UL           
#define EVC_COUNT5_EVC_HPW_BIT_OFFSET (0U)                
#define EVC_COUNT5_EVC_HPW_BIT_LEN    (8U)                
#define EVC_COUNT5_EVC_HPW_BIT_MASK   0xffU                

/******************************************************************************
* @brief Bit definitions for register EVC_COUNT6
**/
#define EVC_COUNT6_ID                      0xf001c              
#define EVC_COUNT6_LEN                     (4U)                
#define EVC_COUNT6_MASK                    0xFFFFFFFFUL        
#define EVC_COUNT6_EVC_PREJ_BIT_OFFSET (0U)                
#define EVC_COUNT6_EVC_PREJ_BIT_LEN    (12U)               
#define EVC_COUNT6_EVC_PREJ_BIT_MASK   0xfffU               
            


/******************************************************************************
* @brief Bit definitions for register TEST_CTRL0
**/
#define TEST_CTRL0_ID                        0xf0024              
#define TEST_CTRL0_LEN                       (4U)                
#define TEST_CTRL0_MASK                      0xFFFFFFFFUL        
#define TEST_CTRL0_CIA_RUN_BIT_OFFSET    (26U)               
#define TEST_CTRL0_CIA_RUN_BIT_LEN       (1U)                
#define TEST_CTRL0_CIA_RUN_BIT_MASK      0x4000000UL          
#define TEST_CTRL0_CIA_WDEN_BIT_OFFSET    (24U)               
#define TEST_CTRL0_CIA_WDEN_BIT_LEN       (1U)                
#define TEST_CTRL0_CIA_WDEN_BIT_MASK      0x1000000UL          
#define TEST_CTRL0_HIRQ_POL_BIT_OFFSET       (21U)               
#define TEST_CTRL0_HIRQ_POL_BIT_LEN          (1U)                
#define TEST_CTRL0_HIRQ_POL_BIT_MASK         0x200000UL           
#define TEST_CTRL0_TX_PSTM_BIT_OFFSET          (4U)                
#define TEST_CTRL0_TX_PSTM_BIT_LEN             (1U)                
#define TEST_CTRL0_TX_PSTM_BIT_MASK            0x10U                

/******************************************************************************
* @brief Bit definitions for register EVC_COUNT7
**/
#define EVC_COUNT7_ID                      0xf0028              
#define EVC_COUNT7_LEN                     (4U)                
#define EVC_COUNT7_MASK                    0xFFFFFFFFUL        
#define EVC_COUNT7_EVC_VWARN_BIT_OFFSET  (16U)               
#define EVC_COUNT7_EVC_VWARN_BIT_LEN     (8U)                
#define EVC_COUNT7_EVC_VWARN_BIT_MASK    0xff0000UL           
#define EVC_COUNT7_EVC_CPQE_BIT_OFFSET  (0U)                
#define EVC_COUNT7_EVC_CPQE_BIT_LEN     (8U)                
#define EVC_COUNT7_EVC_CPQE_BIT_MASK    0xffU                

/******************************************************************************
* @brief Bit definitions for register SPI_MODE
**/
#define SPI_MODE_ID                          0xf002c              
#define SPI_MODE_LEN                         (4U)                
#define SPI_MODE_MASK                        0xFFFFFFFFUL        
#define SPI_MODE_SPI_MODE_BIT_OFFSET         (0U)                
#define SPI_MODE_SPI_MODE_BIT_LEN            (2U)                
#define SPI_MODE_SPI_MODE_BIT_MASK           0x3U                 

/******************************************************************************
* @brief Bit definitions for register SYS_STATE_LO
**/
#define SYS_STATE_LO_ID                      0xf0030              
#define SYS_STATE_LO_LEN                     (4U)                
#define SYS_STATE_LO_MASK                    0xFFFFFFFFUL        



/******************************************************************************
* @brief Bit definitions for register FCMD_STATUS
**/
#define FCMD_STATUS_ID                       0xf003c              
#define FCMD_STATUS_LEN                      (4U)                
#define FCMD_STATUS_MASK                     0xFFFFFFFFUL        
#define FCMD_STATUS_FCMD_STATUS_BIT_OFFSET   (0U)                
#define FCMD_STATUS_FCMD_STATUS_BIT_LEN      (5U)                
#define FCMD_STATUS_FCMD_STATUS_BIT_MASK     0x1fU                

/******************************************************************************
* @brief Bit definitions for register CTR_DBG
**/
#define CTR_DBG_ID                           0xf0048   
#define CTR_DBG_LEN                          (4U)
#define CTR_DBG_MASK                         0xFFFFFFFFUL
#define CTR_DBG_CTR_DBG_BIT_OFFSET           (0U)
#define CTR_DBG_CTR_DBG_BIT_LEN              (32U)
#define CTR_DBG_CTR_DBG_BIT_MASK             0xffffffffUL

